package here;

public class Hmm {
       /*

    하루에 10명만 예약받는 가게

    손님이 입력하는 값: 이름, 전화번호
    입력 후 대기 번호 출력받음.

    대기 번호를 입력하면 해당 대기 번호를 받은 손님의 정보를 조회할 수 있음


    **필요한 것**
    대기번호 변수(1부터 시작)
    <예약>
    입력할 변수 => 손님 이름, 번호
    손님의 정보와 부여받은 대기 번호를 세트로 저장할 때 쓸 배열
    손님의 정보를 초기화할 인스턴스
    <조회>
    입력한 대기 번호에 맞는 손님 정보를 리턴할 메서드(toString)
    정보를 조회할 때 입력할 대기 번호 변수
    (내가 입력하는 값이므로 위에 있는 대기번호를 저장할 변수와는 별개로 두기)

    *고려해야 할 것*
    배열은 0부터 시작하지만 대기 번호는 1부터 시작함
    예약 조회를 할 때 예약이 비어있는 대기 번호(null)를 입력했을 경우
    프로그램이 종료되지 않는 한 되돌아가서 계속 스캔

     */


    //값을 잘못 입력했을 경우....힘들어서 만들지 못했습니다...


}


